# ParamName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ArgumentException..::..ParamName Property
ArgumentException Class See Also
---
Gets the name of the parameter that causes this exception.
**Namespace:** Autodesk.Revit.Exceptions**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string ParamName { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ParamName As String
	Get
```

Visual C++
---
```text
public:
property String^ ParamName {
	String^ get ();
}
```

# See Also
ArgumentException Class
Autodesk.Revit.Exceptions Namespace